package com.vadonmo.exp.chapter;

/**
 * 假设某个用例程序会进行过一系列入栈和出栈的混合栈操作。入栈操作会将整数0-9按顺序压入栈；出栈操作会打印出返回值。下面哪种序列是不可能产生的？
 * a. 4 3 2 1 0 9 8 7 6 5
 * b. 4 6 8 7 5 3 2 9 0 1
 * c. 2 5 6 7 4 8 9 3 1 0
 * d. 4 3 2 1 0 5 6 7 8 9
 * e. 1 2 3 4 5 6 9 8 7 0
 * f. 0 4 6 5 3 8 1 7 2 9
 * g. 1 4 7 9 8 6 5 3 0 2
 * h. 2 1 4 3 6 5 8 7 9 0
 * 
 * @author vadon
 *
 */
public class Exp1_3_3 {
	/*
	 * a. 4 3 2 1 0 9 8 7 6 5 T
	 * b. 4 6 8 7 5 3 2 9 0 1 F
	 * c. 2 5 6 7 4 8 9 3 1 0 T
	 * d. 4 3 2 1 0 5 6 7 8 9 T
	 * e. 1 2 3 4 5 6 9 8 7 0 T
	 * f. 0 4 6 5 3 8 1 7 2 9 F
	 * g. 1 4 7 9 8 6 5 3 0 2 F
	 * h. 2 1 4 3 6 5 8 7 9 0 T
	 */
}
